category_ids = [8,8,8,8,8,8,8,8,8,8,8,8,8,8,8,8,8,8,8,8,9,9,9,9,9,9,9,10,10,10,10,11,11,11,11,11,11,11,11,11,11,11,11,11,11,11,11,11,11,11,11,11,11,11,11,11,11,11,11,11,11,12,12,12,12,12,12,12,12,12,12,13,13,13,13,13,13,13,14,14,14,14,14,14,14,14,14,14,14,14]

genre_ids = [7,7,8,8,8,8,8,8,8,9,9,9,9,9,9,9,9,9,9,9,19,19,19,19,19,19,19,19,19,19,19,10,10,10,10,11,11,11,11,12,12,12,12,13,13,13,13,13,14,14,14,15,15,15,15,15,15,15,15,15,15,16,16,17,17,18,18,19,19,19,19,19,19,19,19,19,19,19,19,19,19,19,19,19,19,19,19,19,19,19]

names = ["バドワイザー(ジョッキ)", "バドワイザー(グラス)", "コロナエキストラ", "モデロエスペシャル", "ネグラモデロ", "テカテ", "ソル", "ドスエキスラガー", "ドスエキスアンバー", "ハードシードル", "バスペールエール", "ドラフトギネス", "アサヒスーパードライ", "ジーマ", "スミノフアイス", "ノンアルコールビール", "黒糖梅酒", "杏露酒", "茘枝酒", "JINRO(Bottle)", "オリータス レポサド", "オリータス ブランコ", "クエルボ ゴールド", "クエルボ シルバー", "タランチュラ アズール", "タランチュラ ストロベリー", "虫入りメスカル グサノーロホ", "ジャックダニエル", "I.W.ハーパー", "フォアローゼズ(白)", "フォアローゼズ(黒)", "ロック", "ジントニック", "ジンライム", "ジンバック", "モスコミュール", "スクリュードライバー", "ソルティドッグ", "ブラッディメアリー", "ロック", "ラムコーク", "ラムトニック", "ラムバック", "テキーラサンライズ", "メキシコーラ", "ヴァンパイア", "テキーラサブマリーナ", "マルガリータ", "シャンディガフ", "レッドアイ", "カンパリビア", "カシスオレンジ", "カシスウーロン", "カンパリオレンジ", "カンパリソーダ", "スプモーニ", "マリブコーク", "カルーアミルク", "ディタグレープフルーツ", "ウーロンハイ", "緑茶ハイ", "カルベネ ソーヴィニヨン", "シャルドネ", "キュベ ドゥ プリンス(赤)", "キュベ ドゥ プリンス(白)", "バルディビエソハーフ(赤)", "バルディビエソ(白)", "グラスワイン(赤)", "グラスワイン(白)", "サングリア(赤)", "サングリア(白)", "生ライムサワー", "生レモンサワー", "カルピスサワー", "ザクロサワー", "巨峰サワー", "青りんごサワー", "グレープフルーツサワー", "インカコーラ", "コカコーラ", "ドライジンジャーエール", "辛口ジンジャーエール", "ソーダ", "トニックウォーター", "オレンジ100%", "グレープフルーツ100%", "トマトジュース", "ウーロン茶", "湘南アイスコーヒー", "ホットコーヒー"]

prices = [540,440,720,720,620,620,620,620,620,480,620,620,620,520,520,300,520,520,520,2100,680,680,480,480,480,480,580,520,520,520,620,420,520,520,520,520,520,520,520,420,520,520,520,520,520,520,720,620,520,520,520,520,520,520,520,520,520,520,620,420,420,3200,3200,2100,2100,1100,1100,420,420,420,420,520,520,420,420,420,420,420,300,300,300,300,200,200,300,300,300,200,300,200]

0.upto(89) do |cnt|
  Drink.create!(
    category_id: category_ids[cnt],
    genre_id: genre_ids[cnt],
    name: names[cnt],
    price: prices[cnt],
    image: "No Image."
  )
end
