category_ids = [1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,2,2,2,2,2,2,2,2,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,3,4,4,4,4,4,4,4,5,5,5,5,5,5,5,6,6,6,6,7,7,7,7]

genre_ids = [2,2,2,2,2,2,2,3,3,3,3,3,3,3,4,4,5,5,5,5,5,5,5,6,6,6,6,6,6,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1]

names = ["160g", "220g", "300g", "450g", "600g", "800g", "1kg", "160g","220g", "300g", "450g", "600g", "800g", "1kg", "150g","250g", "160g", "220g", "300g", "450g", "600g", "800g","1kg", "目玉焼き", "目玉焼きダブル", "チーズ", "ハラペーニョ", "サルサソース", "焼きアボカド","ジャンバラヤ", "ステーキパエリア", "ステーキ丼", "タコライス", "キッズプレート", "ライス", "大盛りライス","パン", "チョリソー", "ケソコンパタタ", "チリコンカルネ", "チリコンケソ", "エンチラーダ", "ケサディーヤ","チミチャンガ", "タキートス", "ケソフォンデート", "セシナ", "カルネアサダ", "ポジョフリート", "コーンバター","ポークスペアリブ", "ホタテバターステーキ", "チョリソコンウェボス", "メキシカンスープ", "コーンスープ", "ビーフタコス", "ビーフソフトタコス", "チョリソータコス", "エビタコス", "フラワートルティーヤ", "コーントルティーヤ", "タコ野菜セット", "チレポテト", "トルティーヤチップス","ナチョス", "ワカモレディップス", "ハラペーニョホッパー", "ハラペーニョ", "サルサソース", "エンサラダデヴェルドラス", "エンサラダデカマロンピカンテ","メキシカンサラダ", "ミニサラダ", "バナナチミチャンガ", "エラードコンワッフル", "アイスクリーム", "オレンジシャーベット"]

prices = [1280,1540,2070,3060,4020,5280,6500,1760,2180,2940,4360,5760,7600,9400,2580,3980,610,840,1110,1670,2160,2880,3500,60,110,200,120,150,180,780,1280,1180,880,800,160,260,140,580,780,680,780,780,680,680,680,580,780,780,780,480,1380,780,780,800,320,630,630,730,730,110,110,580,350,320,680,520,680,250,250,880,780,500,480,420,420,320,360]

0.upto(76) do |cnt|
  Food.create!(
    category_id: category_ids[cnt],
    genre_id: genre_ids[cnt],
    name: names[cnt],
    price: prices[cnt],
    image: "No Image." 
  )
end
